In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame()

In [3]:
type(df1)

pandas.core.frame.DataFrame

In [4]:
print(df1)

Empty DataFrame
Columns: []
Index: []

In [5]:
df1.columns

RangeIndex(start=0, stop=0, step=1)

In [6]:
df1.index

RangeIndex(start=0, stop=0, step=1)

In [7]:
students_list = [['Bob','William', 26, 'Computer Engineering',86], 
                 ['Enma','Johnson',23,'Math',92],
                 ['Sarah','Smith',22,'Chemistry',95],
                 ['Alex','Brown',21,'Electircal Engineering',82]]

In [8]:
students_df = pd.DataFrame(students_list)

In [9]:
students_df

       0        1   2                       3   4
0    Bob  William  26    Computer Engineering  86
1   Enma  Johnson  23                    Math  92
2  Sarah    Smith  22               Chemistry  95
3   Alex    Brown  21  Electircal Engineering  82

In [10]:
students_df = pd.DataFrame(students_list, columns=['Fist_Name','Last_Name','Age','Major','Score'])

In [11]:
students_df

  Fist_Name Last_Name  Age                   Major  Score
0       Bob   William   26    Computer Engineering     86
1      Enma   Johnson   23                    Math     92
2     Sarah     Smith   22               Chemistry     95
3      Alex     Brown   21  Electircal Engineering     82

In [16]:
students_df = pd.DataFrame(students_list,columns=['Fist_Name','Last_Name','Age','Major','Score'],
                    index= ['Bob@mail.com','Emma@mail.com','sarah@mail.com','Alex@mail.com'])

In [18]:
students_df

               Fist_Name Last_Name  Age                   Major  Score
Bob@mail.com         Bob   William   26    Computer Engineering     86
Emma@mail.com       Enma   Johnson   23                    Math     92
sarah@mail.com     Sarah     Smith   22               Chemistry     95
Alex@mail.com       Alex     Brown   21  Electircal Engineering     82

In [19]:
students_dict = {
    'First_Name':['Bob','Emma','Sarah','Alex'],
    'Last_Name':['William','Johnson','Smith','Brown'],
    'Age':[26,23,22,21],
    'Major':['Computer Engineering','Math','Chemistry','Electircal Engineering'],
    'Score':[86,92,95,82],
}

In [22]:
students_df2 =pd.DataFrame(students_dict, columns=['Last_Name','Score','City'])

In [23]:
students_df2

  Last_Name  Score City
0   William     86  NaN
1   Johnson     92  NaN
2     Smith     95  NaN
3     Brown     82  NaN

In [24]:
students_df

               Fist_Name Last_Name  Age                   Major  Score
Bob@mail.com         Bob   William   26    Computer Engineering     86
Emma@mail.com       Enma   Johnson   23                    Math     92
sarah@mail.com     Sarah     Smith   22               Chemistry     95
Alex@mail.com       Alex     Brown   21  Electircal Engineering     82

In [25]:
students_df.columns

Index(['Fist_Name', 'Last_Name', 'Age', 'Major', 'Score'], dtype='object')

In [26]:
students_df.index

Index(['Bob@mail.com', 'Emma@mail.com', 'sarah@mail.com', 'Alex@mail.com'], dtype='object')

In [27]:
students_df.shape

(4, 5)

In [29]:
students_df.head(2)

              Fist_Name Last_Name  Age                 Major  Score
Bob@mail.com        Bob   William   26  Computer Engineering     86
Emma@mail.com      Enma   Johnson   23                  Math     92

In [30]:
students_df.tail(3)

               Fist_Name Last_Name  Age                   Major  Score
Emma@mail.com       Enma   Johnson   23                    Math     92
sarah@mail.com     Sarah     Smith   22               Chemistry     95
Alex@mail.com       Alex     Brown   21  Electircal Engineering     82

In [31]:
students_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Bob@mail.com to Alex@mail.com
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Fist_Name  4 non-null      object
 1   Last_Name  4 non-null      object
 2   Age        4 non-null      int64
 3   Major      4 non-null      object
 4   Score      4 non-null      int64
dtypes: int64(2), object(3)
memory usage: 192.0+ bytes

In [33]:
students_df.describe()

             Age     Score
count   4.000000   4.00000
mean   23.000000  88.75000
std     2.160247   5.85235
min    21.000000  82.00000
25%    21.750000  85.00000
50%    22.500000  89.00000
75%    23.750000  92.75000
max    26.000000  95.00000